In [2]:
import pandas as pd

with open("data/long_lat.txt", "r") as infile:
    for line in infile:
        print(line)

ModuleNotFoundError: No module named 'pandas'

In [1]:
import duckdb
import pandas as pd
import sqlalchemy

# Import ipython-sql Jupyter extension to create SQL cells
%load_ext sql

%config SqlMagic.autopandas = True
%config SqlMagic.feedback = False
%config SqlMagic.displaycon = False

%sql duckdb:////home/evan/workspace/awsdx-hackathon/data/duck.db

In [2]:
%sql SELECT * FROM oppatlas

             tract                             name  econ_mobility
0      30111000300         South Side, Billings, MT        26519.0
1      30013000700                  Great Falls, MT        29828.0
2      46103010500                   Rapid City, SD        29602.0
3      40031001500                       Lawton, OK        34828.0
4      19193001500                   Sioux City, IA        26510.0
...            ...                              ...            ...
73497  47037015629           Antioch, Nashville, TN        37378.0
73498  48113980000                       Irving, TX            NaN
73499   6073021302                        Jamul, CA        40395.0
73500   4013615800  Arrowhead Phase I, Glendale, AZ        59269.0
73501  13297110602                    Covington, GA        43153.0

[73502 rows x 3 columns]

In [30]:
%sql SELECT * FROM ziptract

,zip,tract,usps_zip_pref_city,usps_zip_pref_state,res_ratio,bus_ratio,oth_ratio,tot_ratio
0,683,72023830102,SAN GERMAN,PR,0.000791,0.001116,0.000000,0.000800
1,683,72125840700,SAN GERMAN,PR,0.186219,0.370536,0.381643,0.201179
2,683,72125840400,SAN GERMAN,PR,0.300451,0.187500,0.115942,0.290308
3,683,72125840600,SAN GERMAN,PR,0.095325,0.007812,0.000000,0.088184
4,683,72121960300,SAN GERMAN,PR,0.042402,0.002232,0.019324,0.039435
...,...,...,...,...,...,...,...,...
172172,99163,53075000500,PULLMAN,WA,0.019942,0.001299,0.006263,0.018026
172173,99163,53075000200,PULLMAN,WA,0.205082,0.115584,0.284621,0.207639
172174,99163,53075001000,PULLMAN,WA,0.001415,0.000000,0.000000,0.001239
172175,78635,48171950100,HYE,TX,0.016667,0.000000,0.000000,0.015625
172176,78635,48031950100,HYE,TX,0.983333,1.000000,0.000000,0.984375

In [44]:
%sql ALTER TABLE ziptract ALTER tract TYPE INT64

Empty DataFrame
Columns: []
Index: []

In [16]:
%%sql 
SELECT a.tract as opp_tract, b.tract as zip_tract, b.zip
FROM oppatlas a
RIGHT JOIN (select zip, tract from ziptract) b
ON a.tract = b.tract

           opp_tract    zip_tract    zip
0       7.202383e+10  72023830102    683
1       7.212584e+10  72125840700    683
2       7.212584e+10  72125840400    683
3       7.212584e+10  72125840600    683
4       7.212196e+10  72121960300    683
...              ...          ...    ...
172172  4.605195e+10  46051953300  57263
172173  5.110303e+10  51103030300  22578
172174  5.111393e+10  51113930100  22715
172175  1.606395e+10  16063950100  83330
172176  4.605195e+10  46051953100  57263

[172177 rows x 3 columns]

In [21]:
%sql SELECT count(distinct tract) as distinct_tract, count(distinct zip) as distinct_zip from zip_tract

   distinct_tract  distinct_zip
0           73472         39324